[
  {
    "id": 1,
    "name": "Tafseer Course",
    "desc": "No doubt the knowledge of Quran is the best of all knowledge and it is necessary for Muslims to not only learn the recitation of Holy Quran but also get to know the commandments and rulings of Sharia mentioned in it. Dawat-e-Islami has introduced a very beautiful Faizan-e-Tafseer course (Quran Interpretation) so that you get to know about the events of Prophets, bounties of Almighty and much more in a detailed manner.",
    "img": "https://www.quranteacher.net/public_html/course_images/Faizan-e-Tafseer-Course.jpg",
    "period": "3 Months",
    "duration": "30 Minutes",
    "lang": "Urdu"
  },
  {
    "id": 2,
    "name": "Tasawuf Course",
    "desc": "There is very much to learn from the lives of Sahaba, Tabieen, Taba Tabieen, and many Islamic saints who came after them. In Faizan-e-Tasawuf course you will learn about the mystic lifestyle of our pious predecessors which will further strengthen our faith and deeds which will make our bond strong with our Creator.",
    "img": "https://www.quranteacher.net/public_html/course_images/Tasawuf-Course.jpg",
    "period": "3 Months",
    "duration": "30 Minutes",
    "lang": "Urdu"
  },
  {
    "id": 3,
    "name": "Bahar e Shariat Course",
    "desc": "Bahar e Shariat a well-recognized religious book and this book is a source of becoming an Islamic scholar. In Faizan-e-Bahar e Shariat course you will learn detailed rulings regarding pillars of Islam like Salah (Namaz), Charity (Zakat) Fast (Roza), Pilgrimage (Hajj) and solutions of daily domestic life like Sunnah of Nikkah, Halal and Haram meat, Islamic rulings about new trade strategies of national and international level and much more.",
    "img": "https://www.quranteacher.net/public_html/course_images/bahar-e-shariyat-course.jpg",
    "period": "1 Year",
    "duration": "30 Minutes",
    "lang": "Urdu"
  },
  {
    "id": 4,
    "name": "Ramzan Course",
    "desc": "Fasting is one of the sacred pillars of Islam and observed in the month of Ramadan every lunar year by every sane male and female Muslim. Ramzan course will acknowledge you the importance of Ramzan and its fasts, conditions in which a fast will not be broken, who can give Kaffara in place of fast, Sunnah of Eid Salah, Sharia rulings regarding Fitrana and much other Islamic guidance related new matters to fasting like injection or drip.",
    "img": "https://www.quranteacher.net/public_html/course_images/Faizan-e-Ramzan-Course.jpg",
    "period": "19 Days",
    "duration": "30 Minutes",
    "lang": "Urdu"
  },
  {
    "id": 5,
    "name": "Zakat Course",
    "desc": "Zakat a very prominent pillar of Islam and it is obligatory upon those who reached the level of Nisab mentioned in Holy Quran. Zakat course will enable you to learn the conditions of Zakat being obligatory, sayings of Holy Prophet for those who don’t pay Zakah, who are zakat deserving person and modern-day problems and their solutions related to Zakat.",
    "img": "https://www.quranteacher.net/public_html/course_images/zakat-course.jpg",
    "period": "19 Days",
    "duration": "30 Minutes",
    "lang": "Urdu"
  },
  {
    "id": 6,
    "name": "Shamail e Mustafa Course",
    "desc": "Shamail e Mustafa Course will enlighten your heart and soul with the matchless biography of Holy Prophet. You will get to know the physical beautiful and unexampled appearance of Beloved Prophet, his attractive and polite way of talking; way he eats and drinks, dresses he wore and his sitting and standing position in daily practice and heart touching lifestyle.",
    "img": "https://www.quranteacher.net/public_html/course_images/Shamail-e-Mustafa-Course.jpg",
    "period": "3 Months",
    "duration": "30 Minute",
    "lang": "Urdu"
  },
  {
    "id": 7,
    "name": "Qurbani ke Ahkam Course",
    "desc": "Qurbani ke Ahkam course will clear all the doubts in your mind regarding Qurbani and sacrificial animals. So, in this course you will learn the conditions of Qurbani being Wajib, Sharia ruling if you slaughter the animal before prescribed time, conditions fit for a sacrificial animal and detailed knowledge regarding 7 parts of persons in a sacrificial animal (Ijtima-e-Qurbani).",
    "img": "https://www.quranteacher.net/public_html/course_images/Qurbani-k-Ahkam.jpg",
    "period": "7 Days",
    "duration": "30 Minutes",
    "lang": "Urdu"
  },
  {
    "id": 8,
    "name": "Sunnat e Nikah Course",
    "desc": "Nikah is a sweet Sunnah of our Beloved Prophet and in this Sunnat e Nikah course you will learn every Sunnah and rulings of Nikah like the cases in which Nikah becomes Farz, Wajib and Mustahab, rights of parents and children, conditions for Nikah and many beneficial Madani pearls for leading a prosperous marriage life.",
    "img": "https://www.quranteacher.net/public_html/course_images/Sunnat-e-Nikah-Course.jpg",
    "period": "1 Month",
    "duration": "30 Minutes",
    "lang": "Urdu"
  },
  {
    "id": 9,
    "name": "Tajheez o Takfeen Course",
    "desc": "In Tajheez o Takfeen course you will learn all the methods and Sunnah of Funeral according to Sharia like detailed rulings for men and women shroud, how to bury someone according to Sunnah, Funeral prayer (Namaz e Janaza), how to cover the body with shroud as per Sunnah, Sharia ruling about grave and method of funeral bath, etc.",
    "img": "https://www.quranteacher.net/public_html/course_images/Tajheez-o-Takfeen-Course.jpg",
    "period": "1 Month",
    "duration": "30 Minutes",
    "lang": "Urdu"
  },
  {
    "id": 10,
    "name": "Imamat Course",
    "desc": "Imamat course will rectify the mistakes you make in your Salah so that you not only rectify yours but others Salah as well. Moreover, you will learn that what Islamic qualification is required to lead Salah as an Imam, conditions for Imam, types of Imamat and by doing Imamat how can you increase the Madni work of Dawat-e-Islami.",
    "img": "https://www.quranteacher.net/public_html/course_images/imamat-course-370x208.jpg",
    "period": "2.5/ 5 Months",
    "duration": "30 / 60 Minutes",
    "lang": "Urdu"
  },
  {
    "id": 11,
    "name": "Arabic Grammar Course",
    "desc": "This course not only enables you to learn Quran but you can also understand the meanings and wisdom of Quranic verses. Not only that, you can learn Arabic online with basic grammar so that you can understand Ahadees as well without any consultation and talk to a person efficiently whose mother tongue is Arabic.",
    "img": "https://www.quranteacher.net/public_html/course_images/Arabic-Grammar-Course.jpg",
    "period": "12 Months",
    "duration": "30 / 60 Minutes",
    "lang": "Urdu"
  },
  {
    "id": 12,
    "name": "Farz Uloom Course via Videos",
    "desc": "In this Farz Uloom course, you will learn the basic fundamental rulings of Sharia via videos which is obligatory for every sane male and female to know and act accordingly like five pillars of Islam, Haram & Hilal, permissible & non-permissible acts, Sunnah of Nikkah and precautions for divorce and many other things related to a daily life of Muslim.",
    "img": "https://www.quranteacher.net/public_html/course_images/Farz-Uloom-Course-via-Videos.jpg",
    "period": "3 Months",
    "duration": "30 Minutes",
    "lang": "Urdu"
  },
  {
    "id": 13,
    "name": "Farz Uloom Course via Book",
    "desc": "In this Farz Uloom course, you will learn the basic fundamental rulings of Sharia via book which is obligatory for every sane male and female to know and act accordingly like five pillars of Islam, Haram & Hilal, permissible & non-permissible acts, Sunnah of Nikkah and precautions for divorce and many other things related to a daily life of Muslim.",
    "img": "https://www.quranteacher.net/public_html/course_images/farz-uloom-course.jpg",
    "period": "7 Months",
    "duration": "30 Minutes",
    "lang": "Urdu"
  },
  {
    "id": 14,
    "name": "Hajj Course",
    "desc": "In this Hajj course, you will acknowledge and learn the complete method of Hajj from a renowned book on this topic Rafiq ul Haramain written by Ameer-e-Ahlesunnat, precautions of Ahram, kinds of Hajj, elaboration of all the rituals of Hajj in detail so that you complete this sacred journey in a manner prescribed by Sharia.",
    "img": "https://www.quranteacher.net/public_html/course_images/hajj-course.jpg",
    "period": "2.5 Months",
    "duration": "30 Minutes",
    "lang": "Urdu / English"
  },
  {
    "id": 15,
    "name": "New Muslim Course",
    "desc": "This course is very helpful for those who revert to Islam and in this course; you will get to know the excellence of Islam over other religions. This course will make you understand why Islam is the complete code of life and what are obligatory acts a believer should perform and many other things so that it strengthens your faith.",
    "img": "https://www.quranteacher.net/public_html/course_images/new-muslim-course-370x208.jpg",
    "period": "72 Days",
    "duration": "30 Minutes",
    "lang": "Urdu / English"
  },
  {
    "id": 16,
    "name": "Taharat Course",
    "desc": "Seeking Islamic knowledge is obligatory upon every Muslim in the same manner; a Muslim should stay clean as it is prescribed by Sharia. So in this Taharat course, you will get to know the method of Ghusl, how to purify your clothes, method of doing Tayammum, points which makes a shower mandatory and many excellences of Taharat.",
    "img": "https://www.quranteacher.net/public_html/course_images/Taharat-Course.jpg",
    "period": "30 Days",
    "duration": "30 Minutes",
    "lang": "Urdu / English"
  },
  {
    "id": 17,
    "name": "Hajj Short Course",
    "desc": "In this Hajj course, you will acknowledge and learn the brief method of Hajj from a renowned book on this topic Rafiq ul Haramain written by Ameer-e-Ahlesunnat, precautions of Ahram, kinds of Hajj, elaboration of all the rituals of Hajj so that you complete this sacred journey in a manner prescribed by Sharia.",
    "img": "https://www.quranteacher.net/public_html/course_images/hajj-short-course.jpg",
    "period": "1 Month",
    "duration": "30 Minutes",
    "lang": "Urdu / English"
  },
  {
    "id": 18,
    "name": "Namaz Course",
    "desc": "In Islam the most supreme act of worship is Namaz and it is obligatory upon every Muslim to perform it in a prescribed manner. In this course, you will not only learn the method of five obligatory prayers with them you will also learn Funeral Namaz, Eid Namaz, Nawafil, relaxation in Namaz for a traveler and much more.",
    "img": "https://www.quranteacher.net/public_html/course_images/faizan-e-namaz-course-370x208.jpg",
    "period": "30 Days",
    "duration": "30 Minutes",
    "lang": "Urdu / English"
  }
]
